{
    "page_title": "Send Email using the SMTP Client",
    "smtp_host": "SMTP Host",
    "smtp_host_example": "Example: smtp.gmail.com",
    "smtp_port": "SMTP Port",
    "smtp_timeout": "SMTP Timeout",
    "seconds": "Seconds",
    "smtp_user": "SMTP User",
    "smtp_password": "SMTP Password",
    "email_from": "Email From",
    "email_to": "Email To",
    "email_subject": "Email Subject",
    "enter_smtp_host": "Enter SMTP Host",
    "enter_email_from": "Enter Email From",
    "enter_email_to": "Enter Email To",
    "send_email": "Send Email",
    "email_sent": "Email Sent, SMTP Log",
    "email_error": "Email Error, SMTP Log",
    "email_info_1": "This page allows you to send emails using SMTP (Simple Mail Transfer Protocol) and also shows the log results of communication between the SMTP Client and Server.",
    "email_info_2": "SMTP is the de facto standard for sending outgoing emails; this includes Exchange, Gmail, Outlook, and other popular email apps and sites.",
    "email_info_3": "Sending email through this form can only be done if you download FastSitePHP and use it from a local computer or modify the example source code for your own project.",
    "email_info_4": "The [SMTP Commands] tab on this page can be used for live examples of SMTP API calls.",
    "local_download": "Download FastSitePHP to send emails!",
    "smtp_commands": "SMTP Commands",
    "select_server": "-- Select an SMTP Server --",
    "smtp_info_1": "This page allows you to see a live example of communication between the SMTP Client and widely used SMTP Servers.",
    "smtp_info_2": "Select an SMTP Server from the list and then code shown below will be called.",
    "smtp_info_3": "At times there will be a delay. This is likely a forced delay from the SMTP Server to slow down and block spammers. The call that is delayed will clearly show in the log result.",
    "smtp_info_4": "Typically SMTP is simply used for sending outgoing emails however basic commands can be used by an automated script to verify if the server is working correctly.",
    "why_use": "Why use FastSitePHP for SMTP and Email",
    "info_1": "Easy to use API",
    "info_2": "Great performance and minimal memory needed",
    "info_3": "All SMTP and Email code exists in only small 2 files (each file a separate class). All code is well commented and there is no magic code. For security it’s clear what is going on with the code.",
    "info_4": "Classes are designed around security and reliability, while supporting needed email features",
    "info_5": "Unicode Support including for using Unicode email addresses",
    "info_6": "Easy to include file attachments",
    "info_7": "Easy for debugging SMTP communication (send and reply commands)",
    "other_clients": "Other PHP SMTP Email Clients",
    "info_other": "FastSitePHP only supports SMTP. If you need to use [sendmail], encoding other than UTF8, DKIM, Auth using XOAUTH2, or an un-supported email feature one of the following widely used PHP projects is recommended.",
    "other_lang": "SMTP Clients in other Programming Languages"
}