{
    "page_title": "Enviar E-mail utilizando o cliente SMTP",
    "smtp_host": "Servidor SMTP",
    "smtp_host_example": "Exemplo: smtp.gmail.com",
    "smtp_port": "Porta SMTP",
    "smtp_timeout": "Tempo de Espera SMTP",
    "seconds": "Segundos",
    "smtp_user": "Usuário SMTP",
    "smtp_password": "Senha SMTP",
    "email_from": "Remetente do E-mail",
    "email_to": "Destinatário do E-mail",
    "email_subject": "Assunto do E-mail",
    "enter_smtp_host": "Entre o Servidor SMTP",
    "enter_email_from": "Entre o Remetente do E-mail From",
    "enter_email_to": "Entre o Destinatário do Email",
    "send_email": "Enviar E-mail",
    "email_sent": "E-mail enviado, Log SMTP",
    "email_error": "Erro de E-mail, Log SMTP",
    "email_info_1": "Esta página permite que você envie email utilizando SMTP (Simple Mail Transfer Protocol) e também mostra o relatório dos registros de comunicação entre os Cliente e Servidor SMTP.",
    "email_info_2": "SMTP é o protocolo padrão para envio de e-mails; isto inclui Exchange, Gmail, Outlook e outros apps e sites de gerenciamento de email.",
    "email_info_3": "Enviando e-mail através deste formulário só é possível se você baixar o FastSitePHP e usá-lo à partir de um computador local ou modificar o código fonte de exemplo especificamente para o seu projeto.",
    "email_info_4": "A aba [Comandos SMTP] nesta página pode ser utilizada para em tempo real the chamadas da API SMTP.",
    "local_download": "Baixe o FastSitePHP para enviar e-mails!",
    "smtp_commands": "Comandos SMTP",
    "select_server": "-- Selecione um ServidorSMTP --",
    "smtp_info_1": "Esta página possibilita que você veja um exemplo em tempo real de comunicação entre o Cliente SMTP e Servidores SMTP amplamente utilizados.",
    "smtp_info_2": "Selecione um Servidor SMTP da lista e então o código mostrado abaixo será chamado.",
    "smtp_info_3": "Em alguns momentos haverá um atraso. Isso é provavelmente devido a um atraso forçado pelo Servidor SMTP para retardar e bloquear spammers. A chamada que for adiada será mostrada no relatório do log.",
    "smtp_info_4": "Geralmente SMTP é simplesmente usado para envio de e-mails no entanto comandos básicos pode ser utilizados por um script automatizado para verificar se o servidor está funcionando corretamente.",
    "why_use": "Por que utilizar o FastSitePHP para SMTP e E-mail",
    "info_1": "API de fácil utilização",
    "info_2": "Alto desempenho e baixíssimo uso de memória",
    "info_3": "Todos os códigos de SMTP e E-mail existem em somente dois pequenos arquivos (cada um uma classe separada). Todo os códigos estão muito bem comentados e não há código mágico. Para segurança é claro o que está acontecendo no código.",
    "info_4": "A Classes são projetadas visando segurança e confiabilidade, suportando recursos necessário de e-mail",
    "info_5": "Suporte a Unicode incluindo endereços de e-mail em Unicode",
    "info_6": "Anexos de fácil inclusão",
    "info_7": "Comunicação SMTP de fácil depuração (comandos de envio e reposta)",
    "other_clients": "Outros Clientes de E-mail SMTP em PHP",
    "info_other": "O FastSitePHP suporta somente SMTP. Se você precisa utilizar [sendmail], codificação diferente de UTF8, DKIM, Auth usando XCAUTH2 ou um recurso de e-mail não suportado, um dos seguintes projetos PHP é recomendado.",
    "other_lang": "Clientes SMTP em outras Linguagens de Programação"
}
