{
    "page_title": "Enviar correo electrónico utilizando el cliente SMTP",
    "smtp_host": "Host SMTP",
    "smtp_host_example": "Ejemplo: smtp.gmail.com",
    "smtp_port": "Puerto SMTP",
    "smtp_timeout": "Tiempo de espera de SMTP",
    "seconds": "Segundos",
    "smtp_user": "Usuario SMTP",
    "smtp_password": "Contraseña SMTP",
    "email_from": "Email de",
    "email_to": "Email para",
    "email_subject": "Asunto del email",
    "enter_smtp_host": "Ingresar host SMTP",
    "enter_email_from": "Ingrese correo electrónico de",
    "enter_email_to": "Ingrese correo electrónico a",
    "send_email": "Enviar correo electrónico",
    "email_sent": "Correo electrónico enviado, registro SMTP",
    "email_error": "Error de correo electrónico, registro SMTP",
    "email_info_1": "Esta página le permite enviar correos electrónicos utilizando SMTP (Protocolo simple de transferencia de correo) y también muestra los resultados del registro de la comunicación entre el cliente SMTP y el servidor.",
    "email_info_2": "SMTP es el estándar de facto para enviar correos electrónicos salientes; Esto incluye Exchange, Gmail, Outlook y otras aplicaciones y sitios de correo electrónico populares.",
    "email_info_3": "El envío de correo electrónico a través de este formulario solo se puede hacer si descarga FastSitePHP y lo utiliza desde una computadora local o si modifica el código fuente de ejemplo para su propio proyecto.",
    "email_info_4": "La pestaña [Comandos SMTP] en esta página se puede usar para ejemplos en vivo de llamadas a la API SMTP.",
    "local_download": "¡Descarga FastSitePHP para enviar correos electrónicos!",
    "smtp_commands": "Comandos SMTP",
    "select_server": "-- Seleccione un servidor SMTP --",
    "smtp_info_1": "Esta página le permite ver un ejemplo en vivo de comunicación entre el cliente SMTP y los servidores SMTP ampliamente utilizados.",
    "smtp_info_2": "Seleccione un servidor SMTP de la lista y luego se llamará al código que se muestra a continuación.",
    "smtp_info_3": "A veces habrá un retraso. Es probable que esto sea un retraso forzado del servidor SMTP para reducir la velocidad y bloquear los spammers. La llamada que se retrasa se mostrará claramente en el resultado del registro.",
    "smtp_info_4": "Normalmente, SMTP se usa simplemente para enviar correos electrónicos salientes, sin embargo, los comandos básicos pueden ser utilizados por un script automatizado para verificar si el servidor funciona correctamente.",
    "why_use": "¿Por qué usar FastSitePHP para SMTP y correo electrónico?",
    "info_1": "API fácil de usar",
    "info_2": "Gran rendimiento y memoria mínima necesaria",
    "info_3": "Todos los códigos SMTP y de correo electrónico existen en solo 2 archivos pequeños (cada archivo es una clase separada). Todo el código está bien comentado y no hay código mágico. Por seguridad, está claro lo que está sucediendo con el código.",
    "info_4": "Las clases están diseñadas en torno a la seguridad y la fiabilidad, al tiempo que admiten las funciones de correo electrónico necesarias",
    "info_5": "Soporte Unicode, incluido el uso de direcciones de correo electrónico Unicode",
    "info_6": "Fácil de incluir archivos adjuntos",
    "info_7": "Fácil para depurar la comunicación SMTP (comandos de envío y respuesta)",
    "other_clients": "Otros clientes de correo electrónico SMTP de PHP",
    "info_other": "FastSitePHP solo es compatible con SMTP. Si necesita usar [sendmail], se recomienda la codificación que no sea UTF8, DKIM, Auth usando XOAUTH2 o una función de correo electrónico no compatible, uno de los siguientes proyectos PHP ampliamente utilizados.",
    "other_lang": "Clientes SMTP en otros lenguajes de programación"
}