{
    "page_title": "Página de Inicio",
    "page_desc": "Un framework moderno de código abierto para construir sitios web de alto rendimiento y API con PHP",
    "better_title": "Mejores sitios",
    "better_desc": "FastSitePHP ha sido diseñado para un rendimiento rápido, flexibilidad de codificación, estabilidad a largo plazo, facilidad de uso y una mejor experiencia de desarrollo general. Usando FastSitePHP puedes crear mejores sitios más rápido que nunca.",
    "performance_title": "Gran Desempeño",
    "performance_desc": "Con FastSitePHP, páginas complejas se pueden generar en milésimas de segundos utilizando solo una pequeña cantidad de memoria. Este nivel de rendimiento incluso permite que los sitios se ejecuten rápidamente aún en computadoras de baja potencia.",
    "setup_title": "Fácil de configurar y utilizar",
    "setup_desc": "FastSitePHP está diseñado para que sea fácil de configurar en cualquier sistema operativo, fácil de leer el código, fácil de desarrollar y mucho más. Con FastSitePHP, se pueden desarrollar sitios web y aplicaciones de alta calidad a un ritmo rápido utilizando menos líneas de código y una configuración mínima.",
    "learn_title": "Rápido para aprender y depurar",
    "learn_desc": "FastSitePHP está bien documentado y viene con ejemplos prácticos. FastSitePHP proporciona mensajes de error amigables para el desarrollador a fin de que los errores puedan corregirse rápidamente incluso si tiene poca o ninguna experiencia en programación con PHP.",
    "security_title": "Altos Niveles de Seguridad",
    "security_desc": "La seguridad ha sido cuidadosamente planificada en todas las características de FastSitePHP para que sea tanto segura como fácil de trabajar. Las características de seguridad incluyen Encriptación (texto, objetos y archivos), Cookies firmadas, JWT, CORS, validación del Servidor Proxy, Limitación de Velocidad y más.",
    "test_title": "Pruebas unitarias basadas en la Web",
    "test_desc": "La mayoría de los frameworks se prueban desde la computadora de un desarrollador utilizando herramientas especiales de CLI; sin embargo, esto no garantiza que funcionará en su entorno. FastSitePHP proporciona un método de prueba basado en la web para que todo el código y la velocidad de la página puedan confirmarse fácilmente en cualquier entorno.",
    "create_site": "¡Crea un sitio instantáneo en la Zona de Pruebas!",
    "sample_code": "Código de Muestra"
}
